app/controllers/questions_controller.rb

  def show
    @answer = @question.answers.build
    @answers = @question.answers.order created_at: :desc
---
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = ? ORDER BY "answers"."created_at" DESC  [["question_id", 8]]

  def update
    if @question.update question_params
---
UPDATE "questions" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "questions"."id" = ?  [["title", "Test5"], ["body", "Test5"], ["updated_at", "2022-12-06 19:18:56.309445"], ["id", 6]]

  def create
    @question = Question.new question_params
    if @question.save
---
INSERT INTO "questions" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Title 4"], ["body", "Body 4"], ["created_at", "2022-12-05 20:43:13.551828"], ["updated_at", "2022-12-05 20:43:13.551828"]]

  def set_question!
    @question = Question.find params[:id]
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]